app/controllers/tasks_controller.rb

  def index
    @tasks = current_account.tasks.completed.paginate(:page => params[:page], :per_page => 30)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."account_id" = ?  [["account_id", 2]]

  def create
    @task = current_account.tasks.completed.paginate(:page => params[:page], :per_page => 30)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("name", "description", "is_done", "created_at", "updated_at", "account_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "ASDF"], ["description", "asdfdf"], ["is_done", false], ["created_at", 2016-12-03 19:24:39 UTC], ["updated_at", 2016-12-03 19:24:39 UTC], ["account_id", 2]]

    def set_task
      @task = current_account.tasks.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."account_id" = ? AND "tasks"."id" = ? LIMIT ?  [["account_id", 2], ["id", 1], ["LIMIT", 1]]